name: "CIFAR10_full"
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "/home/wnk/caffe-master/examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "/home/wnk/caffe-master/examples/cifar10/cifar10_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "/home/wnk/caffe-master/examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "/home/wnk/caffe-master/examples/cifar10/cifar10_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
  }
}
layer {
        name:"conv1_bn"
        type:"BatchNorm"
        bottom:"conv1"
        top: "conv1_bn"
        batch_norm_param{
            use_global_stats:true
        }
}
layer {
        name: "scale_conv1"
        type: "Scale"
        bottom: "conv1_bn"
        top:"scale_conv1"
        scale_param{
            bias_term:true
        }
}
layer {
        name: "pool1"
        type: "Pooling"
        bottom: "scale_conv1"
        top: "pool1"
        pooling_param {
            pool: MAX
            kernel_size: 3
            stride: 2
        }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}

layer {
	name:"conv2_bn"
    type:"BatchNorm"
    bottom:"conv2"
    top: "conv2_bn"
    batch_norm_param{
    	use_global_stats:true
    }
}
layer {
	name: "scale_conv2"
    type: "Scale"
    bottom: "conv2_bn"
    top:"scale_conv2"
    scale_param{
    	bias_term:true
    }
}


layer {
  name: "pool2"
  type: "Pooling"
  bottom: "scale_conv2"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "pool2"
  top: "pool2"
}


layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}

layer {
	name:"conv3_bn"
    type:"BatchNorm"
    bottom:"conv3"
    top: "conv3_bn"
    batch_norm_param{
    	use_global_stats:true
    }
}
layer {
	name: "scale_conv3"
    type: "Scale"
    bottom: "conv3_bn"
    top:"scale_conv3"
    scale_param{
    	bias_term:true
    }
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "scale_conv3"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip1"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}
